{
  "architectures": [
    "NoPELlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 3,
  "dtype": "bfloat16",
  "eos_token_id": 1,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 384,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "max_position_embeddings": 1024,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 6,
  "num_hidden_layers": 6,
  "num_key_value_heads": 6,
  "pad_token_id": 4,
  "pretraining_tp": 1,
  "recipe_name": "arithmetic_self_improve_v1",
  "rms_norm_eps": 1e-06,
  "rope_parameters": {
    "rope_theta": 10000.0,
    "rope_type": "default"
  },
  "tie_word_embeddings": false,
  "transformers_version": "5.2.0",
  "use_cache": false,
  "use_no_position_embeddings": true,
  "vocab_size": 103
}
